"""
Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |

"""

number = input("Введите трехзначное число: ")
n = int(number)

d1 = n % 10
n = n // 10
d2 = n % 10
n = n // 10
sum = n + d1 + d2

print("{} -> {} ({} + {} + {})".format(number, sum, n, d1, d2))